LemonEntry,partOfSpeech,writtenForm,comparative,superlative,SyntacticFrame,predFrame,sense,reference,oils:boundTo,oils:degree,domain,range,Question1,SPARQL Question 1,Question 3,SPARQL Question 3,Question 4,sparql 4,Question 5,sparql 5
high,adjective,উচ্চ,চেয়ে উচ্চ,সর্বোচ্চ,AdjectiveGradableFrame,PredSynArg,1,oils:CovariantScalar,dbo:height,oils:high,dbo:ArchitecturalStructure,xsd:double,How উচ্চ is X(dbo:ArchitecturalStructure)?,SELECT ?Y WHERE { X dbo:height ?Y. },What is the সর্বোচ্চ X (dbo:ArchitecturalStructure) in the world?,SELECT ?Y WHERE { ?Y dbo:height ?V } ORDER BY DESC ?Y LIMIT 1,"What is the সর্বোচ্চ X (dbo:ArchitecturalStructure) in (Country, Z)?",-,-,
-,adjective,উচ্চ,চেয়ে উচ্চ,সর্বোচ্চ,AdjectiveGradableFrame,PredSynArg,1,oils:CovariantScalar,dbo:height,oils:high,dbo:Building,xsd:double,How উচ্চ is X(dbo:Building)?,SELECT ?Y WHERE { X dbo:height ?Y. },What is the সর্বোচ্চ X (dbo:Building) in the world?,SELECT ?Y WHERE { ?Y dbo:height ?V } ORDER BY DESC ?Y LIMIT 1,"What is the সর্বোচ্চ X (dbo:Building) in (Country, Z)?",-,-,
-,adjective,উচ্চ,চেয়ে উচ্চ,সর্বোচ্চ,AdjectiveGradableFrame,PredSynArg,1,oils:CovariantScalar,dbo:height,oils:high,dbo:Bridge,xsd:double,How উচ্চ is X(dbo:Bridge)?,SELECT ?Y WHERE { X dbo:height ?Y. },What is the সর্বোচ্চ X (dbo:Bridge) in the world?,SELECT ?Y WHERE { ?Y dbo:height ?V } ORDER BY DESC ?Y LIMIT 1,"What is the সর্বোচ্চ X (dbo:Bridge) in (Country, Z)?",-,-,
-,adjective,উচ্চ,চেয়ে উচ্চ,সর্বোচ্চ,AdjectiveGradableFrame,PredSynArg,1,oils:CovariantScalar,dbo:elevation,oils:strong,dbo:Mountain,xsd:string,How উচ্চ is X(dbo:Mountain)?,SELECT ?Y WHERE { X dbo:elevation ?Y. },What is the সর্বোচ্চ X (dbo:Mountain) in the world?,SELECT ?Y WHERE { ?Y dbo:elevation ?V } ORDER BY DESC ?Y LIMIT 1,"What is the সর্বোচ্চ X (dbo:Mountain) in (Country, Z)?",,-,
tall,adjective,লম্বা,চেয়ে লম্বা,সবচেয়ে লম্বা,AdjectiveGradableFrame,PredSynArg,1,oils:CovariantScalar,dbo:elevation,oils:strong,dbo:Mountain,xsd:double,How লম্বা is X(dbo:Mountain)?,SELECT ?Y WHERE { X dbo:elevation ?Y. },What is the সবচেয়ে লম্বা X (dbo:Mountain) in the world?,SELECT ?Y WHERE { ?Y dbo:elevation ?V } ORDER BY DESC ?Y LIMIT 1,"What is the সবচেয়ে লম্বা X (dbo:Mountain) in (Country, Z)?",,-,
big,adjective,বড়,চেয়ে বড়,বৃহত্তম,AdjectiveGradableFrame,PredSynArg,1,oils:CovariantScalar,dbo:seatingCapacity,oils:high,dbo:Stadium,xsd:string,How বড় is X(dbo:Stadium)?,SELECT ?Y WHERE { X dbo:seatingCapacity ?Y. },What is the বৃহত্তম X (dbo:Stadium) in the world?,SELECT ?Y WHERE { ?Y dbo:seatingCapacity ?V } ORDER BY DESC ?Y LIMIT 1,"What is the বৃহত্তম X (dbo:Stadium) in (Country, Z)?",,-,
large,adjective,বড়,চেয়ে বড়,বৃহত্তম,AdjectiveGradableFrame,PredSynArg,1,oils:CovariantScalar,dbo:areaTotal,oils:high,dbo:City,xsd:string,How বড় is X(dbo:City)?,SELECT ?Y WHERE { X dbo:areaTotal ?Y. },What is the বৃহত্তম X (dbo:City) in the world?,SELECT ?Y WHERE { ?Y dbo:areaTotal ?V } ORDER BY DESC ?Y LIMIT 1,"What is the বৃহত্তম X (dbo:City) in (Country, Z)?",-,What is the বৃহত্তম X (dbo:City)?,
-,adjective,বড়,চেয়ে বড়,বৃহত্তম,AdjectiveGradableFrame,PredSynArg,1,oils:CovariantScalar,dbo:populationTotal,oils:high,dbo:City,xsd:string,How বড় is X(dbo:City)?,SELECT ?Y WHERE { X dbo:populationTotal ?Y. },What is the বৃহত্তম X (dbo:City) in the world?,SELECT ?Y WHERE { ?Y dbo:populationTotal ?V } ORDER BY DESC ?Y LIMIT 1,"What is the বৃহত্তম X (dbo:City) in (Country, Z)?",,,
small,adjective,ছোট,চেয়ে ছোট,সবচেয়ে ছোট,AdjectiveGradableFrame,PredSynArg,1,oils:ContravariantScalar,dbo:areaTotal,oils:weak,dbo:City,xsd:string,-,-,What is the সবচেয়ে ছোট X (dbo:City) in the world?,SELECT ?Y WHERE { ?Y dbo:areaTotal ?V } ORDER BY ASC ?Y LIMIT 1,"What is the সবচেয়ে ছোট X (dbo:City) in (Country, Z)?",-,What is the সবচেয়ে ছোট X (dbo:City)?,
-,adjective,ছোট,চেয়ে ছোট,সবচেয়ে ছোট,AdjectiveGradableFrame,PredSynArg,1,oils:ContravariantScalar,dbo:areaTotal,oils:weak,dbc:Cities_in_Germany,xsd:string,-,-,-,-,-,-,What is the সবচেয়ে ছোট X (dbc:Cities_in_Germany)?,
long,adjective,দীর্ঘ,চেয়ে  দীর্ঘ,দীর্ঘতম,AdjectiveGradableFrame,PredSynArg,1,oils:CovariantScalar,dbo:length,oils:high,dbo:BodyOfWater,xsd:string,How দীর্ঘ is X(dbo:BodyOfWater)?,SELECT ?Y WHERE { X dbo:length ?Y. },What is the দীর্ঘতম X (dbo:BodyOfWater) in the world?,SELECT ?Y WHERE { ?Y dbo:length ?V } ORDER BY DESC ?Y LIMIT 1,"What is the দীর্ঘতম X (dbo:BodyOfWater) in (Country, Z)?",-,-,
populous,adjective,জনবহুল,-,জনবহুল,AdjectiveGradableFrame,PredSynArg,1,oils:CovariantScalar,dbo:populationTotal,oils:high,dbc:Cities_in_Germany,xsd:string,-,-,-,-,-,-,What is the জনবহুল X (dbc:Cities_in_Germany)?,
-,adjective,জনবহুল,-,কম জনবহুল,AdjectiveGradableFrame,PredSynArg,1,oils:ContravariantScalar,dbo:populationTotal,oils:weak,dbc:Cities_in_Germany,xsd:string,-,-,-,-,-,-,What is the কম জনবহুল X (dbc:Cities_in_Germany)?,
short,adjective,খাটো,চেয়ে খাটো,সবচেয়ে খাটো,AdjectiveGradableFrame,PredSynArg,1,oils:ContravariantScalar,dbo:length,oils:low,dbo:River,xsd:string,-,-,What is the সবচেয়ে খাটো X (dbo:River)?,SELECT ?Y WHERE { ?Y dbo:length ?V } ORDER BY ASC ?Y LIMIT 1,-,,,