LemonEntry,partOfSpeech,writtenFormInfinitive/2ndPerson,writtenForm3rdPerson,writtenFormPast,preposition,SyntacticFrame,subject,prepositionalAdjunct,sense,reference,domain,range,GrammarRule 1 :question 1,GrammarRule 1 :question 2,GrammarRule 1 :sparql,Grammar rule 2: question1,Grammar rule 2: question2,sparql2
flow_through,verb,flow,,,through,InTransitiveFrame,domain,range,1,dbo:country,dbo:River,dbo:Country,What dbo:River(X)  through Y(dbo:Country)?,FALSE,SELECT ?X WHERE { ?X dbo:country Y.},Which dbo:Country(X) does Y(dbo:River) flow through?,FALSE,SELECT ?X WHERE { Y dbo:country ?X.}
-,verb,flow,,,through,InTransitiveFrame,domain,range,2,dbo:city,dbo:River,dbo:City,What dbo:River(X)  through Y(dbo:City)?,FALSE,SELECT ?X WHERE { ?X dbo:city Y.},Which dbo:City(X) does Y(dbo:River) flow through?,FALSE,SELECT ?X WHERE { Y dbo:city ?X.}
grow_in,verb,grow,,,in,InTransitiveFrame,range,domain,1,dbo:growingGrape,dbo:WineRegion,dbo:Grape,What dbo:Grape (Y)  in X(dbo:WineRegion)? ,FALSE,SELECT ?Y WHERE { X dbo:growingGrape ?Y.},Which dbo:WineRegion (X) does Y(dbo:Grape) grow in?,FALSE,SELECT ?X WHERE { ?X dbo:growingGrape Y.}
stand_for,verb,stand,,,for,InTransitiveFrame,range,domain,1,dbo:abbreviation,owl:Thing,dbo:string,What dbo:string (Y)  for X(owl:Thing)? ,FALSE,SELECT ?Y WHERE { X dbo:abbreviation ?Y.},Which owl:Thing (X) does Y(dbo:string) stand for?,FALSE,SELECT ?X WHERE { ?X dbo:abbreviation Y.}
starr_in,verb,star,,,in,InTransitiveFrame,domain,range,1,dbo:starring,dbo:Film,dbo:Actor,What dbo:Film(X)  in Y(dbo:Actor)?,FALSE,SELECT ?X WHERE { ?X dbo:starring Y.},Which dbo:Actor(X) does Y(dbo:Film) star in?,FALSE,SELECT ?X WHERE { Y dbo:starring ?X.}
begin_at,verb,begin,,,at,InTransitiveFrame,domain,range,1,dbp:source1Location,dbo:River,dbo:Country,What dbo:River(X)  at Y(dbo:Country)?,FALSE,SELECT ?X WHERE { ?X dbp:source1Location Y.},Which dbo:Country(X) does Y(dbo:River) begin at?,FALSE,SELECT ?X WHERE { Y dbp:source1Location ?X.}
-,verb,begin,,,at,InTransitiveFrame,domain,range,1,dbp:source2Location,dbo:River,dbo:City,What dbo:River(X)  at Y(dbo:City)?,FALSE,SELECT ?X WHERE { ?X dbp:source2Location Y.},Which dbo:City(X) does Y(dbo:River) begin at?,FALSE,SELECT ?X WHERE { Y dbp:source2Location ?X.}
flow_into,verb,flow,,,into,InTransitiveFrame,range,domain,1,dbo:inflow,dbo:BodyOfWater,dbo:BodyOfWater,What dbo:BodyOfWater (Y)  into X(dbo:BodyOfWater)? ,FALSE,SELECT ?Y WHERE { X dbo:inflow ?Y.},Which dbo:BodyOfWater (X) does Y(dbo:BodyOfWater) flow into?,FALSE,SELECT ?X WHERE { ?X dbo:inflow Y.}
draft_in,verb,draft,,,in,InTransitiveFrame,domain,range,1,dbo:draftYear,dbo:AmericanFootballPlayer,xsd:gYear,What dbo:AmericanFootballPlayer(X)  in Y(xsd:gYear)?,FALSE,SELECT ?X WHERE { ?X dbo:draftYear Y.},Which xsd:gYear(X) does Y(dbo:AmericanFootballPlayer) draft in?,FALSE,SELECT ?X WHERE { Y dbo:draftYear ?X.}
complete_in,verb,complete,,,in,InTransitiveFrame,domain,range,1,dbo:buildingEndDate,dbo:ArchitecturalStructure,xsd:gYear,-,FALSE,SELECT ?X WHERE { ?X dbo:buildingEndDate Y.},-,FALSE,SELECT ?X WHERE { Y dbo:buildingEndDate ?X.}
-,verb,complete,,,in,InTransitiveFrame,domain,range,2,dbo:completionDate,dbo:Work,xsd:gYear,-,FALSE,SELECT ?X WHERE { ?X dbo:completionDate Y.},-,FALSE,SELECT ?X WHERE { Y dbo:completionDate ?X.}
build_in,verb,build,,,in,InTransitiveFrame,domain,range,1,dbo:buildingStartDate,dbo:ArchitecturalStructure,xsd:gYear,-,FALSE,SELECT ?X WHERE { ?X dbo:buildingStartDate Y.},-,FALSE,SELECT ?X WHERE { Y dbo:buildingStartDate ?X.}
inaugurate_in,verb,inaugurate,,,in,InTransitiveFrame,domain,range,1,dbo:openingDate,dbo:ArchitecturalStructure,xsd:gYear,-,FALSE,SELECT ?X WHERE { ?X dbo:openingDate Y.},-,FALSE,SELECT ?X WHERE { Y dbo:openingDate ?X.}
founded_on,verb,find,,,on,InTransitiveFrame,domain,range,1,dbo:foundingDate,dbo:Organisation,xsd:date,-,Which dbo:Organisation(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:foundingDate Y.},-,When xsd:date(X) was Y(dbo:Organisation)  ?,SELECT ?X WHERE { Y dbo:foundingDate ?X.}
-,verb,found,,,on,InTransitiveFrame,domain,range,2,dbo:foundingDate,dbo:Settlement,xsd:date,-,Which dbo:Settlement(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:foundingDate Y.},-,When xsd:date(X) was Y(dbo:Settlement)  ?,SELECT ?X WHERE { Y dbo:foundingDate ?X.}
-,verb,found,,,on,InTransitiveFrame,domain,range,4,dbo:formationDate,dbo:PoliticalParty,xsd:date,-,Which dbo:PoliticalParty(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:formationDate Y.},-,When xsd:date(X) was Y(dbo:PoliticalParty)  ?,SELECT ?X WHERE { Y dbo:formationDate ?X.}
founded_in,verb,find,,,in,InTransitiveFrame,domain,range,2,dbo:foundingYear,dbo:Organisation,xsd:gYear,,FALSE,SELECT ?X WHERE { ?X dbo:foundingYear Y.},-,FALSE,SELECT ?X WHERE { Y dbo:foundingYear ?X.}
released_on,verb,release,,,at,InTransitiveFrame,domain,range,1,dbo:releaseDate,dbo:TelevisionShow,xsd:date,-,Which dbo:TelevisionShow(X) was  at Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:releaseDate Y.},-,When xsd:date(X) was Y(dbo:TelevisionShow)  ?,SELECT ?X WHERE { Y dbo:releaseDate ?X.}
-,verb,release,,,at,InTransitiveFrame,domain,range,2,dbo:releaseDate,dbo:Song,xsd:date,-,Which dbo:Song(X) was  at Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:releaseDate Y.},-,When xsd:date(X) was Y(dbo:Song)  ?,SELECT ?X WHERE { Y dbo:releaseDate ?X.}
-,verb,release,,,at,InTransitiveFrame,domain,range,3,dbo:releaseDate,dbo:Software,xsd:date,-,Which dbo:Software(X) was  at Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:releaseDate Y.},-,When xsd:date(X) was Y(dbo:Software)  ?,SELECT ?X WHERE { Y dbo:releaseDate ?X.}
,verb,release,,,on,InTransitiveFrame,domain,range,1,dbo:computingPlatform,dbo:Software,owl:Thing,What dbo:Software(X)  on Y(owl:Thing)?,FALSE,SELECT ?X WHERE { ?X dbo:computingPlatform Y.},Which owl:Thing(X) does Y(dbo:Software) release on?,FALSE,SELECT ?X WHERE { Y dbo:computingPlatform ?X.}
published_on,verb,publish,,,on,InTransitiveFrame,domain,range,1,dbp:published,dbo:Song,xsd:date,-,Which dbo:Song(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbp:published Y.},-,When xsd:date(X) was Y(dbo:Song)  ?,SELECT ?X WHERE { Y dbp:published ?X.}
-,verb,publish,,,on,InTransitiveFrame,domain,range,1,dbp:published,dbo:Article,xsd:date,-,Which dbo:Article(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbp:published Y.},-,When xsd:date(X) was Y(dbo:Article)  ?,SELECT ?X WHERE { Y dbp:published ?X.}
-,verb,publish,,,on,InTransitiveFrame,domain,range,1,dbo:publicationDate,dbo:Book,xsd:date,-,Which dbo:Book(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:publicationDate Y.},-,When xsd:date(X) was Y(dbo:Book)  ?,SELECT ?X WHERE { Y dbo:publicationDate ?X.}
dissolve_on,verb,dissolve,,,on,InTransitiveFrame,domain,range,1,dbo:dissolutionDate,dbo:PopulatedPlace,xsd:date,-,Which dbo:PopulatedPlace(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:dissolutionDate Y.},-,When xsd:date(X) was Y(dbo:PopulatedPlace)  ?,SELECT ?X WHERE { Y dbo:dissolutionDate ?X.}
destroy_on,verb,destroy,,,on,InTransitiveFrame,domain,range,1,dbo:demolitionDate,dbo:ArchitecturalStructure,xsd:date,-,Which dbo:ArchitecturalStructure(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:demolitionDate Y.},-,When xsd:date(X) was Y(dbo:ArchitecturalStructure)  ?,SELECT ?X WHERE { Y dbo:demolitionDate ?X.}
rebuild_on,verb,rebuild,,,on,InTransitiveFrame,domain,range,1,dbo:rebuildingDate,dbo:ArchitecturalStructure,xsd:date,-,Which dbo:ArchitecturalStructure(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:rebuildingDate Y.},-,When xsd:date(X) was Y(dbo:ArchitecturalStructure)  ?,SELECT ?X WHERE { Y dbo:rebuildingDate ?X.}
reopen_on,verb,reopen,,,on,InTransitiveFrame,domain,range,1,dbo:reopeningDate,dbo:ArchitecturalStructure,xsd:date,-,Which dbo:ArchitecturalStructure(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:reopeningDate Y.},-,When xsd:date(X) was Y(dbo:ArchitecturalStructure)  ?,SELECT ?X WHERE { Y dbo:reopeningDate ?X.}
discontinue_on,verb,discontinue,,,on,InTransitiveFrame,domain,range,1,dbo:discontinued,dbo:Beverage,xsd:date,-,Which dbo:Beverage(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:discontinued Y.},-,When xsd:date(X) was Y(dbo:Beverage)  ?,SELECT ?X WHERE { Y dbo:discontinued ?X.}
introduced_on,verb,introduce,,,on,InTransitiveFrame,domain,range,1,dbo:introduced,dbo:Beverage,xsd:date,-,Which dbo:Beverage(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:introduced Y.},-,When xsd:date(X) was Y(dbo:Beverage)  ?,SELECT ?X WHERE { Y dbo:introduced ?X.}
open_on,verb,open,,,on,InTransitiveFrame,domain,range,1,dbo:openingDate,dbo:Bridge,xsd:date,-,Which dbo:Bridge(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:openingDate Y.},-,When xsd:date(X) was Y(dbo:Bridge)  ?,SELECT ?X WHERE { Y dbo:openingDate ?X.}
open_in,verb,open,,,in,InTransitiveFrame,domain,range,1,dbo:openingYear,dbo:Bridge,xsd:gYear,-,FALSE,SELECT ?X WHERE { ?X dbo:openingYear Y.},-,FALSE,SELECT ?X WHERE { Y dbo:openingYear ?X.}
produced_on,verb,produce,,,on,InTransitiveFrame,domain,range,1,dbo:productionDate,dbo:Film,xsd:date,-,Which dbo:Film(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:productionDate Y.},-,When xsd:date(X) was Y(dbo:Film)  ?,SELECT ?X WHERE { Y dbo:productionDate ?X.}
-,verb,produce,,,on,InTransitiveFrame,domain,range,2,dbo:productionDate,dbo:Album,xsd:date,-,Which dbo:Album(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:productionDate Y.},-,When xsd:date(X) was Y(dbo:Album)  ?,SELECT ?X WHERE { Y dbo:productionDate ?X.}
-,verb,produce,,,in,InTransitiveFrame,domain,range,3,dbo:productionDate,dbo:Song,xsd:date,-,Which dbo:Song(X) was  in Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:productionDate Y.},-,When xsd:date(X) was Y(dbo:Song)  ?,SELECT ?X WHERE { Y dbo:productionDate ?X.}
establish_in,verb,establish,,,in,InTransitiveFrame,domain,range,1,dbo:firstPublicationYear,dbo:PeriodicalLiterature,xsd:gYear,-,FALSE,SELECT ?X WHERE { ?X dbo:firstPublicationYear Y.},Which xsd:gYear(X) does Y(dbo:PeriodicalLiterature) establish in?,FALSE,SELECT ?X WHERE { Y dbo:firstPublicationYear ?X.}
form_in,verb,form,,,in,InTransitiveFrame,domain,range,1,dbo:activeYearsStartYear,dbo:Band,xsd:date,-,Which dbo:Band(X) was  in Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:activeYearsStartYear Y.},Which xsd:date(X) does Y(dbo:Band) form in?,When xsd:date(X) was Y(dbo:Band)  ?,SELECT ?X WHERE { Y dbo:activeYearsStartYear ?X.}
born _on,verb,born,,,on,InTransitiveFrame,domain,range,1,dbo:birthDate,dbo:Person,xsd:date,-,Which dbo:Person(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:birthDate Y.},-,When xsd:date(X) was Y(dbo:Person)  ?,SELECT ?X WHERE { Y dbo:birthDate ?X.}
live_in,verb,live,,,in,InTransitiveFrame,domain,range,1,dbo:residence,dbo:Person,dbo:Place,What dbo:Person(X)  in Y(dbo:Place)?,FALSE,SELECT ?X WHERE { ?X dbo:residence Y.},Which dbo:Place(X) does Y(dbo:Person) live in?,FALSE,SELECT ?X WHERE { Y dbo:residence ?X.}
die_on,verb,die,,,on,InTransitiveFrame,domain,range,1,dbo:deathDate,dbo:Person,xsd:date,-,Which dbo:Person(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:deathDate Y.},-,When xsd:date(X) was Y(dbo:Person)  ?,SELECT ?X WHERE { Y dbo:deathDate ?X.}
die_from,verb,die,,,from,InTransitiveFrame,domain,range,1,dbo:deathCause,dbo:Person,owl:Thing,-,FALSE,SELECT ?X WHERE { ?X dbo:deathCause Y.},-,FALSE,SELECT ?X WHERE { Y dbo:deathCause ?X.}
-,verb,die,,,from,InTransitiveFrame,domain,range,1,dbp:deathCause,dbo:Person,dbo:Disease,What dbo:Person(X)  from Y(dbo:Disease)?,FALSE,SELECT ?X WHERE { ?X dbp:deathCause Y.},-,FALSE,SELECT ?X WHERE { Y dbp:deathCause ?X.}
take_place_in,verb,take place,,,in,InTransitiveFrame,domain,range,1,dbo:place,dbo:MilitaryConflict,dbo:PopulatedPlace,What dbo:MilitaryConflict(X)  in Y(dbo:PopulatedPlace)?,FALSE,SELECT ?X WHERE { ?X dbo:place Y.},-,FALSE,SELECT ?X WHERE { Y dbo:place ?X.}
-,verb,take place,,,in,InTransitiveFrame,domain,range,2,dbo:date,dbo:MilitaryConflict,xsd:date,What dbo:MilitaryConflict(X)  in Y(xsd:date)?,Which dbo:MilitaryConflict(X) was  in Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:date Y.},Which xsd:date(X) does Y(dbo:MilitaryConflict) take place in?,When xsd:date(X) was Y(dbo:MilitaryConflict)  ?,SELECT ?X WHERE { Y dbo:date ?X.}
compose_for,verb,compose,,,for,InTransitiveFrame,domain,range,1,dbo:musicComposer,dbo:Work,dbo:Person,What dbo:Work(X)  for Y(dbo:Person)?,FALSE,SELECT ?X WHERE { ?X dbo:musicComposer Y.},Which dbo:Person(X) does Y(dbo:Work) compose for?,FALSE,SELECT ?X WHERE { Y dbo:musicComposer ?X.}
-,verb,compose,,,for,InTransitiveFrame,domain,range,2,dbo:composer,dbo:Work,dbo:Person,What dbo:Work(X)  for Y(dbo:Person)?,FALSE,SELECT ?X WHERE { ?X dbo:composer Y.},Which dbo:Person(X) does Y(dbo:Work) compose for?,FALSE,SELECT ?X WHERE { Y dbo:composer ?X.}
-,verb,compose,,,for,InTransitiveFrame,domain,range,3,dbp:music,dbo:Work,dbo:Person,What dbo:Work(X)  for Y(dbo:Person)?,FALSE,SELECT ?X WHERE { ?X dbp:music Y.},Which dbo:Person(X) does Y(dbo:Work) compose for?,FALSE,SELECT ?X WHERE { Y dbp:music ?X.}
work_for,verb,work,,,for,InTransitiveFrame,domain,range,1,dbo:keyPerson,dbo:Organisation,dbo:Person,What dbo:Organisation(X)  for Y(dbo:Person)?,FALSE,SELECT ?X WHERE { ?X dbo:keyPerson Y.},Which dbo:Person(X) does Y(dbo:Organisation) work for?,FALSE,SELECT ?X WHERE { Y dbo:keyPerson ?X.}
-,verb,work,,,for,InTransitiveFrame,domain,range,2,dbp:keyPeople,dbo:Organisation,dbo:Person,What dbo:Organisation(X)  for Y(dbo:Person)?,FALSE,SELECT ?X WHERE { ?X dbp:keyPeople Y.},Which dbo:Person(X) does Y(dbo:Organisation) work for?,FALSE,SELECT ?X WHERE { Y dbp:keyPeople ?X.}
bury_in,verb,bury,,,in,InTransitiveFrame,domain,range,1,dbp:burialPlace,dbo:Person,dbo:City,What dbo:Person(X)  in Y(dbo:City)?,FALSE,SELECT ?X WHERE { ?X dbp:burialPlace Y.},Which dbo:City(X) does Y(dbo:Person) bury in?,FALSE,SELECT ?X WHERE { Y dbp:burialPlace ?X.}
start_acting_on,verb,start acting,,,on,InTransitiveFrame,domain,range,1,dbo:activeYearsStartYear,dbo:Actor,xsd:date,-,Which dbo:Actor(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:activeYearsStartYear Y.},-,When xsd:date(X) was Y(dbo:Actor)  ?,SELECT ?X WHERE { Y dbo:activeYearsStartYear ?X.}
stop_acting_on,verb,stop acting,,,on,InTransitiveFrame,domain,range,1,dbo:activeYearsEndYear,dbo:Actor,xsd:date,-,Which dbo:Actor(X) was  on Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:activeYearsEndYear Y.},-,When xsd:date(X) was Y(dbo:Actor)  ?,SELECT ?X WHERE { Y dbo:activeYearsEndYear ?X.}
fight_in,verb,fight,,,in,InTransitiveFrame,range,domain,1,dbo:combatant,dbo:MilitaryConflict,xsd:string,What xsd:string (Y)  in X(dbo:MilitaryConflict)? ,FALSE,SELECT ?Y WHERE { X dbo:combatant ?Y.},-,FALSE,SELECT ?X WHERE { ?X dbo:combatant Y.}
play_in,verb,play,,,in,InTransitiveFrame,domain,range,1,dbo:member,dbo:Person,dbo:Band,What dbo:Person(X)  in Y(dbo:Band)?,FALSE,SELECT ?X WHERE { ?X dbo:member Y.},Which dbo:Band(X) does Y(dbo:Person) play in?,FALSE,SELECT ?X WHERE { Y dbo:member ?X.}
,verb,play,,,in,InTransitiveFrame,domain,range,2,dbo:member,dbo:Person,dbo:Play,What dbo:Person(X)  in Y(dbo:Play)?,FALSE,SELECT ?X WHERE { ?X dbo:member Y.},Which dbo:Play(X) does Y(dbo:Person) play in?,FALSE,SELECT ?X WHERE { Y dbo:member ?X.}
-,verb,play,,,in,InTransitiveFrame,domain,range,3,dbo:position,dbo:Person,owl:Thing,What dbo:Person(X)  in Y(owl:Thing)?,FALSE,SELECT ?X WHERE { ?X dbo:position Y.},Which owl:Thing(X) does Y(dbo:Person) play in?,FALSE,SELECT ?X WHERE { Y dbo:position ?X.}
split_up_in,verb,split up,,,in,InTransitiveFrame,domain,range,1,dbo:activeYearsEndYear,dbo:Band,xsd:date,-,Which dbo:Band(X) was  in Y(xsd:date)?,SELECT ?X WHERE { ?X dbo:activeYearsEndYear Y.},Which xsd:date(X) does Y(dbo:Band) split up in?,When xsd:date(X) was Y(dbo:Band)  ?,SELECT ?X WHERE { Y dbo:activeYearsEndYear ?X.}
study_at,verb,study,,,at,InTransitiveFrame,domain,range,1,dbo:education,dbo:Person,dbo:EducationalInstitution,What dbo:Person(X)  at Y(dbo:EducationalInstitution)?,FALSE,SELECT ?X WHERE { ?X dbo:education Y.},Which dbo:EducationalInstitution(X) does Y(dbo:Person) study at?,FALSE,SELECT ?X WHERE { Y dbo:education ?X.}
relate_to,verb,relate,,,to,InTransitiveFrame,domain,range,1,dbo:related,dbo:Beverage,dbo:Beverage,What dbo:Beverage(X)  to Y(dbo:Beverage)?,FALSE,SELECT ?X WHERE { ?X dbo:related Y.},Which dbo:Beverage(X) does Y(dbo:Beverage) relate to?,FALSE,SELECT ?X WHERE { Y dbo:related ?X.}
record_in,verb,record,,,in,InTransitiveFrame,domain,range,1,dbo:recordedIn,dbo:MusicalWork,dbo:PopulatedPlace,What dbo:MusicalWork(X)  in Y(dbo:PopulatedPlace)?,FALSE,SELECT ?X WHERE { ?X dbo:recordedIn Y.},Which dbo:PopulatedPlace(X) does Y(dbo:MusicalWork) record in?,FALSE,SELECT ?X WHERE { Y dbo:recordedIn ?X.}
locate_in,verb,locate,,,in,InTransitiveFrame,domain,range,2,dbo:location,dbo:City,dbo:Country ,What dbo:City(X)  in Y(dbo:Country )?,FALSE,SELECT ?X WHERE { ?X dbo:location Y.},Which dbo:Country (X) does Y(dbo:City) locate in?,FALSE,SELECT ?X WHERE { Y dbo:location ?X.}
-,verb,locate,,,in,InTransitiveFrame,domain,range,4,dbo:location,dbo:Airport,dbo:Place,What dbo:Airport(X)  in Y(dbo:Place)?,FALSE,SELECT ?X WHERE { ?X dbo:location Y.},Which dbo:Place(X) does Y(dbo:Airport) locate in?,FALSE,SELECT ?X WHERE { Y dbo:location ?X.}
-,verb,locate,,,in,InTransitiveFrame,domain,range,9,dbo:location,dbo:BodyOfWater,dbo:Place,What dbo:BodyOfWater(X)  in Y(dbo:Place)?,FALSE,SELECT ?X WHERE { ?X dbo:location Y.},Which dbo:Place(X) does Y(dbo:BodyOfWater) locate in?,FALSE,SELECT ?X WHERE { Y dbo:location ?X.}
-,verb,locate,,,in,InTransitiveFrame,domain,range,5,dbo:country,dbo:Mountain,dbo:Country,What dbo:Mountain(X)  in Y(dbo:Country)?,FALSE,SELECT ?X WHERE { ?X dbo:country Y.},Which dbo:Country(X) does Y(dbo:Mountain) locate in?,FALSE,SELECT ?X WHERE { Y dbo:country ?X.}
-,verb,locate,,,in,InTransitiveFrame,domain,range,6,dbo:locatedInArea,dbo:Place,dbo:Place,What dbo:Place(X)  in Y(dbo:Place)?,FALSE,SELECT ?X WHERE { ?X dbo:locatedInArea Y.},Which dbo:Place(X) does Y(dbo:Place) locate in?,FALSE,SELECT ?X WHERE { Y dbo:locatedInArea ?X.}
-,verb,locate,,,in,InTransitiveFrame,domain,range,7,dbo:country,dbo:Settlement,dbo:Country,What dbo:Settlement(X)  in Y(dbo:Country)?,FALSE,SELECT ?X WHERE { ?X dbo:country Y.},Which dbo:Country(X) does Y(dbo:Settlement) locate in?,FALSE,SELECT ?X WHERE { Y dbo:country ?X.}
-,verb,locate,,,in,InTransitiveFrame,domain,range,8,dbo:country,dbo:BodyOfWater,dbo:Country,What dbo:BodyOfWater(X)  in Y(dbo:Country)?,FALSE,SELECT ?X WHERE { ?X dbo:country Y.},Which dbo:Country(X) does Y(dbo:BodyOfWater) locate in?,FALSE,SELECT ?X WHERE { Y dbo:country ?X.}
-,verb,locate,,,in,InTransitiveFrame,domain,range,1,dbo:location,dbo:Organisation,dbo:Place,What dbo:Organisation(X)  in Y(dbo:Place)?,FALSE,SELECT ?X WHERE { ?X dbo:location Y.},Which dbo:Place(X) does Y(dbo:Organisation) locate in?,FALSE,SELECT ?X WHERE { Y dbo:location ?X.}
-,verb,locate,,,in,InTransitiveFrame,domain,range,3,dbo:city,dbo:Airport,dbo:City,What dbo:Airport(X)  in Y(dbo:City)?,FALSE,SELECT ?X WHERE { ?X dbo:city Y.},Which dbo:City(X) does Y(dbo:Airport) locate in?,FALSE,SELECT ?X WHERE { Y dbo:city ?X.}
belong_to,verb,belong,,,to,InTransitiveFrame,domain,range,3,dbp:album,dbo:Song,dbo:Album,What dbo:Song(X)  to Y(dbo:Album)?,FALSE,SELECT ?X WHERE { ?X dbp:album Y.},Which dbo:Album(X) does Y(dbo:Song) belong to?,FALSE,SELECT ?X WHERE { Y dbp:album ?X.}
-,verb,belong,,,to,InTransitiveFrame,domain,range,1,dbo:species,dbo:Animal,dbp:species,What dbo:Animal(X)  to Y(dbp:species)?,FALSE,SELECT ?X WHERE { ?X dbo:species Y.},Which dbp:species(X) does Y(dbo:Animal) belong to?,FALSE,SELECT ?X WHERE { Y dbo:species ?X.}
-,verb,belong,,,to,InTransitiveFrame,domain,range,2,dbp:genre,dbo:Album,dbo:Genre,What dbo:Album(X)  to Y(dbo:Genre)?,FALSE,SELECT ?X WHERE { ?X dbp:genre Y.},Which dbo:Genre(X) does Y(dbo:Album) belong to?,FALSE,SELECT ?X WHERE { Y dbp:genre ?X.}
-,verb,belong,,,to,InTransitiveFrame,domain,range,4,dbo:genre,dbo:Film,dbo:Genre,What dbo:Film(X)  to Y(dbo:Genre)?,FALSE,SELECT ?X WHERE { ?X dbo:genre Y.},Which dbo:Genre(X) does Y(dbo:Film) belong to?,FALSE,SELECT ?X WHERE { Y dbo:genre ?X.}
-,verb,belong,,,to,InTransitiveFrame,domain,range,5,dbp:partof,dbo:Airport,yago:Facility103315023,What dbo:Airport(X)  to Y(yago:Facility103315023)?,FALSE,SELECT ?X WHERE { ?X dbp:partof Y.},Which yago:Facility103315023(X) does Y(dbo:Airport) belong to?,FALSE,SELECT ?X WHERE { Y dbp:partof ?X.}
-,verb,belong,,,to,InTransitiveFrame,domain,range,6,dbp:party,dbo:Agent,dbo:PoliticalParty,What dbo:Agent(X)  to Y(dbo:PoliticalParty)?,FALSE,SELECT ?X WHERE { ?X dbp:party Y.},Which dbo:PoliticalParty(X) does Y(dbo:Agent) belong to?,FALSE,SELECT ?X WHERE { Y dbp:party ?X.}
-,verb,belong,,,to,InTransitiveFrame,domain,range,7,dbo:literaryGenre,dbo:WrittenWork,dbo:Genre,What dbo:WrittenWork(X)  to Y(dbo:Genre)?,FALSE,SELECT ?X WHERE { ?X dbo:literaryGenre Y.},Which dbo:Genre(X) does Y(dbo:WrittenWork) belong to?,FALSE,SELECT ?X WHERE { Y dbo:literaryGenre ?X.}
-,verb,belong,,,to,InTransitiveFrame,domain,range,8,dbo:mountainRange,dbo:Mountain,dbo:MountainRange,What dbo:Mountain(X)  to Y(dbo:MountainRange)?,FALSE,SELECT ?X WHERE { ?X dbo:mountainRange Y.},Which dbo:MountainRange(X) does Y(dbo:Mountain) belong to?,FALSE,SELECT ?X WHERE { Y dbo:mountainRange ?X.}
-,verb,belong,,,to,InTransitiveFrame,domain,range,9,dbo:genre,dbo:Band,dbo:Genre,What dbo:Band(X)  to Y(dbo:Genre)?,FALSE,SELECT ?X WHERE { ?X dbo:genre Y.},Which dbo:Genre(X) does Y(dbo:Band) belong to?,FALSE,SELECT ?X WHERE { Y dbo:genre ?X.}
-,verb,belong,,,to,InTransitiveFrame,domain,range,10,dbo:bandMember,dbo:Person,dbo:Band,What dbo:Person(X)  to Y(dbo:Band)?,FALSE,SELECT ?X WHERE { ?X dbo:bandMember Y.},Which dbo:Band(X) does Y(dbo:Person) belong to?,FALSE,SELECT ?X WHERE { Y dbo:bandMember ?X.}
-,verb,belong,,,to,InTransitiveFrame,domain,range,11,dbo:genre,dbo:Software,dbo:Genre,What dbo:Software(X)  to Y(dbo:Genre)?,FALSE,SELECT ?X WHERE { ?X dbo:genre Y.},Which dbo:Genre(X) does Y(dbo:Software) belong to?,FALSE,SELECT ?X WHERE { Y dbo:genre ?X.}
-,verb,belong,,,to,InTransitiveFrame,domain,range,12,dbo:series,dbo:Software,owl:Thing,What dbo:Software(X)  to Y(owl:Thing)?,FALSE,SELECT ?X WHERE { ?X dbo:series Y.},Which owl:Thing(X) does Y(dbo:Software) belong to?,FALSE,SELECT ?X WHERE { Y dbo:series ?X.}
-,verb,belong,,,to,InTransitiveFrame,domain,range,13,dbo:genre,dbo:Artist,dbo:Genre,What dbo:Artist(X)  to Y(dbo:Genre)?,FALSE,SELECT ?X WHERE { ?X dbo:genre Y.},Which dbo:Genre(X) does Y(dbo:Artist) belong to?,FALSE,SELECT ?X WHERE { Y dbo:genre ?X.}
-,verb,belong,,,to,InTransitiveFrame,domain,range,14,dbo:team,dbo:Person,dbo:SportsTeam,What dbo:Person(X)  to Y(dbo:SportsTeam)?,FALSE,SELECT ?X WHERE { ?X dbo:team Y.},Which dbo:SportsTeam(X) does Y(dbo:Person) belong to?,FALSE,SELECT ?X WHERE { Y dbo:team ?X.}
-,verb,belong,,,to,InTransitiveFrame,domain,range,15,dbo:subdivision,dbo:Settlement,dbo:Place,What dbo:Settlement(X)  to Y(dbo:Place)?,FALSE,SELECT ?X WHERE { ?X dbo:subdivision Y.},Which dbo:Place(X) does Y(dbo:Settlement) belong to?,FALSE,SELECT ?X WHERE { Y dbo:subdivision ?X.}
-,verb,belong,,,to,InTransitiveFrame,domain,range,16,dbo:timeZone,dbo:Place,yago:TimeZone108691276,What dbo:Place(X)  to Y(yago:TimeZone108691276)?,FALSE,SELECT ?X WHERE { ?X dbo:timeZone Y.},Which yago:TimeZone108691276(X) does Y(dbo:Place) belong to?,FALSE,SELECT ?X WHERE { Y dbo:timeZone ?X.}
-,verb,belong,,,to,InTransitiveFrame,domain,range,17,dbo:architecturalStyle,dbo:ArchitecturalStructure,owl:Thing,What dbo:ArchitecturalStructure(X)  to Y(owl:Thing)?,FALSE,SELECT ?X WHERE { ?X dbo:architecturalStyle Y.},Which owl:Thing(X) does Y(dbo:ArchitecturalStructure) belong to?,FALSE,SELECT ?X WHERE { Y dbo:architecturalStyle ?X.}
-,verb,belong,,,to,InTransitiveFrame,domain,range,18,dbo:formerTeam,dbo:Athlete,dbo:SportsTeam,What dbo:Athlete(X)  to Y(dbo:SportsTeam)?,FALSE,SELECT ?X WHERE { ?X dbo:formerTeam Y.},Which dbo:SportsTeam(X) does Y(dbo:Athlete) belong to?,FALSE,SELECT ?X WHERE { Y dbo:formerTeam ?X.}
play_for,verb,play,,,for,InTransitiveFrame,domain,range,1,dbo:debutTeam,dbo:Athlete,dbo:SportsTeam,What dbo:Athlete(X)  for Y(dbo:SportsTeam)?,FALSE,SELECT ?X WHERE { ?X dbo:debutTeam Y.},Which dbo:SportsTeam(X) does Y(dbo:Athlete) play for?,FALSE,SELECT ?X WHERE { Y dbo:debutTeam ?X.}
name_after,verb,name,,,after,InTransitiveFrame,domain,range,1,dbo:namedAfter,dbo:Settlement,dbo:Agent,What dbo:Settlement(X)  after Y(dbo:Agent)?,FALSE,SELECT ?X WHERE { ?X dbo:namedAfter Y.},Which dbo:Agent(X) does Y(dbo:Settlement) name after?,FALSE,SELECT ?X WHERE { Y dbo:namedAfter ?X.}
associate_with,verb,associate,,,with,InTransitiveFrame,domain,range,1,dbo:associatedBand,dbo:Band,dbo:Band,What dbo:Band(X)  with Y(dbo:Band)?,FALSE,SELECT ?X WHERE { ?X dbo:associatedBand Y.},Which dbo:Band(X) does Y(dbo:Band) associate with?,FALSE,SELECT ?X WHERE { Y dbo:associatedBand ?X.}
-,verb,associate,,,with,InTransitiveFrame,domain,range,2,dbo:associatedMusicalArtist,dbo:Band,dbo:MusicalArtist,What dbo:Band(X)  with Y(dbo:MusicalArtist)?,FALSE,SELECT ?X WHERE { ?X dbo:associatedMusicalArtist Y.},Which dbo:MusicalArtist(X) does Y(dbo:Band) associate with?,FALSE,SELECT ?X WHERE { Y dbo:associatedMusicalArtist ?X.}
-,verb,associate,,,with,InTransitiveFrame,domain,range,3,dbo:movement,dbo:Artist,owl:Thing,What dbo:Artist(X)  with Y(owl:Thing)?,FALSE,SELECT ?X WHERE { ?X dbo:movement Y.},Which owl:Thing(X) does Y(dbo:Artist) associate with?,FALSE,SELECT ?X WHERE { Y dbo:movement ?X.}
currently_use_for,verb,currently use,,,for,InTransitiveFrame,domain,range,1,dbo:currentlyUsedFor,dbo:ArchitecturalStructure,xsd:string,What dbo:ArchitecturalStructure(X)  for Y(xsd:string)?,FALSE,SELECT ?X WHERE { ?X dbo:currentlyUsedFor Y.},Which xsd:string(X) does Y(dbo:ArchitecturalStructure) currently use for?,FALSE,SELECT ?X WHERE { Y dbo:currentlyUsedFor ?X.}
initially_use_for,verb,initially use,,,for,InTransitiveFrame,domain,range,2,dbo:initiallyUsedFor,dbo:ArchitecturalStructure,xsd:string,What dbo:ArchitecturalStructure(X)  for Y(xsd:string)?,FALSE,SELECT ?X WHERE { ?X dbo:initiallyUsedFor Y.},Which xsd:string(X) does Y(dbo:ArchitecturalStructure) initially use for?,FALSE,SELECT ?X WHERE { Y dbo:initiallyUsedFor ?X.}
originate_in,verb,originate,,,in,InTransitiveFrame,domain,range,1,dbo:sourceCountry,dbo:Stream,dbo:Country,What dbo:Stream(X)  in Y(dbo:Country)?,FALSE,SELECT ?X WHERE { ?X dbo:sourceCountry Y.},Which dbo:Country(X) does Y(dbo:Stream) originate in?,FALSE,SELECT ?X WHERE { Y dbo:sourceCountry ?X.}
end_in,verb,end,,,in,InTransitiveFrame,domain,range,1,dbo:mouthPlace,dbo:River,dbo:PopulatedPlace,What dbo:River(X)  in Y(dbo:PopulatedPlace)?,FALSE,SELECT ?X WHERE { ?X dbo:mouthPlace Y.},Which dbo:PopulatedPlace(X) does Y(dbo:River) end in?,FALSE,SELECT ?X WHERE { Y dbo:mouthPlace ?X.}
-,verb,end,,,in,InTransitiveFrame,domain,range,2,dbo:mouthCountry,dbo:River,dbo:Country,What dbo:River(X)  in Y(dbo:Country)?,FALSE,SELECT ?X WHERE { ?X dbo:mouthCountry Y.},Which dbo:Country(X) does Y(dbo:River) end in?,FALSE,SELECT ?X WHERE { Y dbo:mouthCountry ?X.}
be_from,verb,be,,,from,InTransitiveFrame,domain,range,1,dbo:hometown,dbo:Agent,dbo:Settlement,What dbo:Agent(X)  from Y(dbo:Settlement)?,FALSE,SELECT ?X WHERE { ?X dbo:hometown Y.},Which dbo:Settlement(X) does Y(dbo:Agent) be from?,FALSE,SELECT ?X WHERE { Y dbo:hometown ?X.}
border_in,verb,border,,,in,InTransitiveFrame,domain,range,1,dbo:borderingstates,dbo:State,dbo:State,What dbo:State(X)  in Y(dbo:State)?,FALSE,SELECT ?X WHERE { ?X dbo:borderingstates Y.},Which dbo:State(X) does Y(dbo:State) border in?,FALSE,SELECT ?X WHERE { Y dbo:borderingstates ?X.}
-,verb,bury,,,in,InTransitiveFrame,domain,range,2,dbo:restingPlace,dbo:Person,dbo:Place,-,FALSE,SELECT ?X WHERE { ?X dbo:restingPlace Y.},-,FALSE,SELECT ?X WHERE { Y dbo:restingPlace ?X.}